[
    {
        "id": "201908",
        "background": {"backgroundImage":"url(images/briefNlv.png)"},
        "title": "Night Light Visuals",
        "role": "Web Designer & Developer",
        "type": "Web",
        "intro": "You're looking at it right now! A personal portfolio site for web and game projects I have and will work on. Completely revamped and redesigned in August 2019.",
        "link": "https://github.com/CarNg/webdev-nlv-portfolio-2019",
        "images":{
            "Night Light Visuals Image 1": "/images/sliderNlv1.png",
            "Night Light Visuals Image 2": "/images/sliderNlv2.png",
            "Night Light Visuals Image 3": "/images/sliderNlv3.png",
            "Night Light Visuals Image 4": "/images/sliderNlv4.png"
        },
        "projectKey": {
            "created using":"ReactJS",
            "for": "Night Light Visuals"
        },
        "projectDetails": {
            "Summary":"A redesign was long overdue for Night Light Visuals so here it is. It was also long overdue for me to learn and become familiar with ReactJS and this was the perfect opportunity for me to kick it all off. All future web and game projects will be hosted here too so stay tuned as I continue to learn and grow my portfolio and resume.",
            "Goal":"Create something that was much simpler, cleaner and more straight-forward. It also needed to be easily updatable and more importantly, responsive! Also, master ReactJS.",
            "Approach":"In order to create a simpler, cleaner look, text was kept to a minimum (with the exception of project details) and vertical scrolling was avoided where possible. Since the website was built on ReactJS, it's made adding projects in the future incredibly easy. Project details are generated via a JSON file that is hosted on github and images are held in the public folder. This allows me to add projects without having to rebuild every time."
        }
    },
    {
        "id": "201704",
        "background": {"backgroundImage":"url(images/briefRttech.png)"},
        "title": "RT-Technology",
        "role": "Web Desginer & Developer",
        "type": "Web",
        "intro": "A simple, responsive landing page designed to showcase the company's different services and websites from one location.",
        "link": "https://github.com/CarNg/webdev-rt-tech;https://carng.github.io/webdev-rt-tech/",
        "images":{
            "RT Technology Landing Page Image 1": "/images/sliderRttech1.png",
            "RT Technology Landing Page Image 2": "/images/sliderRttech2.png"
        },
        "projectKey": {
            "created using":"HTML5 - CSS3",
            "for": "RT-Technology Idea Ltd."
        },
        "projectDetails": {
            "Summary":"RT-Technology Idea Ltd. provides a number of services, each with their own dedicated website, so it was important for them to have just one location for potential clients to access all the information on these services.",
            "Goal":"Create something clean, interactive and eye-catching.",
            "Approach":"A minimalistic design was used to keep the page clear and concise. A single image was used per service and a simple on-hover animation using CSS3 was implemented for desktop users to add some movement to the page. For mobile users, a portrait version of the design was used."
        }
    },
    {
        "id": "201703",
        "background": {"backgroundImage":"url(images/briefBabypos.png)"},
        "title": "BabyPOS Web Application",
        "role": "Web Developer",
        "type": "Web",
        "intro": "A web application to accompany BabyPOS POS System where staff members and employers could access, review and update information on their POS system.",
        "images":{
            "BabyPOS Web App Image 1": "/images/sliderBabypos1.png",
            "BabyPOS Web App Image 2": "/images/sliderBabypos2.png",
            "BabyPOS Web App Image 3": "/images/sliderBabypos3.png"
        },
        "projectKey": {
            "created using":"PHP - Bootstrap - jQuery - MySQL",
            "for": "RT-Technology Idea Ltd."
        },
        "projectDetails": {
            "Summary":"The accompaniment for BabyPOS POS System allowed users to review daily, weekly and monthly sales, view and edit product details and update stock information. Users could also view and edit staff members', shop members' and vendors' information and records depending on the permissions set for each individual login account.",
            "Goal":"Create a platform that was easy to use, understand and free of issues as it was going to be used by a large number of staff and employers with varying computing skills.",
            "Approach":"Maintenance and enhancements were made on a regular basis to ensure that everything worked as smooth as possible and any unnecessary information was removed to reduce confusion. In unique cases, customised reports and features such as a custom label generator, were added for individual clients to increase usability."
        }
    },
    {
        "id": "201606",
        "background": {"backgroundImage":"url(images/briefSusweet.png)"},
        "title": "SuSweet",
        "role": "Web Developer",
        "type": "Web",
        "intro": "An online shop that we migrated from Magento to OpenCart and added a large number of customisations to to solve the issues the client was originally having.",
        "images":{
            "image1": "/images/briefNlv.png",
            "image2": "/images/briefNlv.png"
        },
        "projectKey": {
            "created using":"PHP - OpenCart",
            "for": "SuSweet"
        },
        "projectDetails": {
            "Summary":"Susweet was an online shop that was originally hosted on Magento eCommerce. However, the client wished to migrate to OpenCart as he saw some features and plugins available on OpenCart that better suited his needs.",
            "Goal":"Migrate to OpenCart, customise the new site and install a number of plugins requested by the client.",
            "Approach":"The migration of hundreds of products was carried out using a Cart2Cart service. Once this was completed, existing modifications that were on Magento were then applied to the new OpenCart page. These modifications were primarily style changes in CSS. Following that, the plugins requested by the client were installed and modifications were then made to them where possible to allow for even more customisation for the client. Plugins may have included extra shipping options and modifications may include naming conventions or styles that were not originally available in the plugin."
        }
    },
    {
        "id": "201504",
        "background": {"backgroundImage":"url(images/briefEdenIsle.png)"},
        "title": "Eden Isle: Resort Paradise",
        "role": "Game Designer",
        "type": "Digital",
        "intro": "Eden Isle: Resort Paradise is a multi-award winning F2P sim game that lets players build and manage a holiday resort.",
        "link": "https://www.edenislegame.com/",
        "images":{
            "image1": "/images/briefNlv.png",
            "image2": "/images/briefNlv.png"
        },
        "projectKey": {
            "available on":"iOS",
            "for":"Simteractive"
        },
        "projectDetails": {
            "Summary":"Eden Isle: Resort Paradise is the debut release of Dublin-based game development studio, Simteractive and is available now on the App Store. It is a free to play building sim game that allows users to build and manage a holiday resort.",
            "Gameplay":"Gameplay includes building the optimal resort layout, maximising decor bonuses, monitoring the needs of individual guests and adjusting the prices and quality levels of their businesses. The game introduces resource management as well as quirky characters in the form of resort guests.",
            "Responsibilities":"I worked on a variety of game design areas for the game such as game balancing, basic mechanics and tutorial design. I also assisted in researching current user needs and competitors, performed QA, worked with testers, analysed test results, created UI mockups and wrote some in-game narrative.",
            "Experience": "The internship allowed me to learn and experience the game development process within a professional environment. I was able to work with the programming team and art team to implement the designs set by game designers and experience the dynamics in a game development studio. In addition, I was nominated for Writers' Guild of Ireland ZeBBie Award for Best Game Script as a co-writer Eden Isle as a result of my work on the game's narrative."
        }
    },
    {
        "id": "201502",
        "background": {"backgroundImage":"url(images/briefAbst.png)"},
        "title": "Anything But Small Talk",
        "role": "Game Designer",
        "type": "Analog",
        "intro": "Anything But Small Talk is a storytelling card game based on the themes of memory and misdirection. It was designed to encourage conversation between players, especially the listening aspect of conversation.",
        "images":{
            "image1": "/images/briefNlv.png",
            "image2": "/images/briefNlv.png"
        },
        "projectKey": {
            "for":"4+ players",
            "to play in": "~15minutes per player"
        },
        "projectDetails": {
            "Summary":"Anything But Small Talk! (ABST!) is the first game I designed solo and its a personal favourite. It is inspired by YouTube channel SourceFedNERD’s Table Talk series, Apollo Robbins' TED Talk on 'The Art of Misdirection' and introversion. I had been reading about introversion when I came across the quote 'Introverts do not hate small talk because we dislike people. We hate small talk because we hate the barrier it creates between people.' That was something that I related to so strongly that I wanted to design a game that would allow people to skip the small talk and encourage us to listen to and give players the opportunity to get to know each other and share their stories.",
            "Gameplay":"So how does this storytelling card game work? Each card will have two parts - Talk and Listen. Talk is the conversation topic and Listen is a question relating to the topic. Let's use a simple example: Talk may be ‘Discuss your favourite movie and why.’ and Listen may be ‘Who is the director of my favourite movie?’. The first player, we'll call him James, will draw a card and share what's on the Talk side with the rest of the group. The Listen side is for James to know only and not shared with the group. For the next *five minutes, the group will discuss their favourite movie. During this time, James must clearly mention who the director of his favourite movie is (as mentioned on the Listen side) at least twice. James' objective is to do so subtly cause his goal is the misdirect the other players from the real question. He can do this by steering the conversation away from the director or appear to focus on other aspects of the movie more. Meanwhile, the other players are trying to figure out what the question is and remember the answer. All the while, trying to distract the other players from doing the same. Once every player has had a go, in the same order the cards were drawn, the question on the Listen side of the cards will now be asked by the player who drew the card. In this example, James will now ask ‘Who is the director of my favourite movie?’. For each wrong answer, James will get a point. For every answer a player gets right, they get two points. This will continue till all players have asked their question. Play restarts and continues and the first player to reach *10 points wins.",
            "Customise":"*You can tweak the rules! ABST! is flexible and there are many variants that can be tailored to suit the environment you’re playing in. The above is simply a guideline. You can vary how long each discussion is and how many points are required to win. You can even switch it up by changing the winning conditions altogether. You can have most points after x amount of rounds or maybe it's game night or a dinner party and you want conversation to flow all night; you can eliminate time limits altogether. For example, at the start of the night, each participant draws a card each and conversations on those topics carry on throughout the night. At the end of the night, the questions are asked and the best listener wins! Of course, the topics are entirely customisable too! You can always make your own topics too, hypothetical or factual. The stories you share can be real or they can be made up too. The answers can be as serious or as silly and light-hearted as you want. That’s all up to you, make it suit your game group, have fun with it! If you give the game a go, I'd love to hear about it. Happy conversing!",
            "Experience": "Like I said, ABST! is the first game I designed solo and it's one that has a soft spot in my heart. The game itself is still only an idea and one with no real playtesting. However, it is still a personal favourite because as the design grew, so did my passion for game design. The prospect of making and sharing this game was thrilling. Not only was I designing a game that I wanted to play, I was designing it based on something I cared about deeply and couldn't wait to share."
        }
    },
    {
        "id": "201501",
        "background": {"backgroundImage":"url(images/briefNlv2015.png)"},
        "title": "Night Light Visuals (2015)",
        "role": "Web Designer & Developer",
        "type": "Web",
        "intro": "An older version of my personal portfolio website first designed and developed back in 2015.",
        "link": "https://github.com/CarNg/webdev-nlv-portfolio-2015",
        "images":{
            "image1": "/images/briefNlv.png",
            "image2": "/images/briefNlv.png"
        },
        "projectKey": {
            "created using":"HTML - CSS - JavaScript - jQuery",
            "for": "Night Light Visuals"
        },
        "projectDetails": {
            "Summary":"This was one of the original portfolio websites developed for Night List Visuals.",
            "Goal":"Create a space to host and showcase my game design and visual media projects that was easy to navigate and demonstrated my work behind each project.",
            "Approach":"The design behind the website was influenced by Night Light Visuals' previous logo design which was based on neon lights. Borders, buttons and links were all based off of this idea. Game design projects and visual media projects were colour coded to the two colours in the logo for easy navigation. Filters were also added for project pages for better navigation and usability."
        }
    },
    {
        "id": "201412",
        "background": {"backgroundImage":"url(images/briefSketch.png)"},
        "title": "Sketch!",
        "role": "Game Designer & Developer",
        "type": "Digital",
        "intro": "Sketch! is a small 2D game where your goal is to woo your crush. Fill the swoon meter and get a date but be careful not to get caught or you'll be spending Friday night in detention instead.",
        "link": "https://github.com/CarNg/game-sketch-prototype",
        "images":{
            "image1": "/images/briefNlv.png",
            "image2": "/images/briefNlv.png"
        },
        "projectKey": {
            "available on":"Unity Webplayer (WebGL version and playable link coming soon)",
            "created using": "Unity - Photoshop"
        },
        "projectDetails": {
            "Summary":"Sketch! was developed as part of a game design and Unity exercise. The task was to brainstorm a list of random themes and develop each theme with a mind map. Next, narrow it down to one theme, design some basic mechanics associated with the theme and finally, create a 2D game. My theme was 'School' and the result was Sketch!",
            "Gameplay":"As mentioned, Sketch! is a 2D game, it takes place in a classroom and your goal is to woo your crush without getting caught. Players collect gifts scattered around the classroom to give to their crush. The teacher will turn around at random intervals to scan the room though and if you're caught walking around, your gift will be confiscated and you'll have to return to your seat. Get three warnings and you'll get detention and fail to get a date. The teacher will become more weary as time goes on and will scan the room more often and faster too so watch out.",
            "Responsibilities":" Sketch! was a solo project that was developed using Unity and Photoshop. All aspects of the game (game design, programming, art work) except audio and fonts are my own. I take no credit for the audio and no copyright infringements are intended.",
            "Experience": "Developing Sketch! was a great learning experience for me. A number of mechanics were added and refined during the design and development process as a result of testing. For example, playtesting proved that the initial game was too easy and predictable. So to overcome this, random triggers were added to the speed and direction of the teacher to add some unpredictability. Sketch! also showed me how a simple and seemingly boring theme - School - can actually generate so many interesting mechanics and be developed into a fun little game."
        }
    },
    {
        "id": "201411",
        "background": {"backgroundImage":"url(images/briefTta.png)"},
        "title": "This Time Around",
        "role": "Game Designer & Developer",
        "type": "Digital",
        "intro": "This Time Around is an interactive story/exploration game based on the themes of forgiveness and memories. Players follow along Rachel Daniels' journey as she grows from an adolescent to an adult.",
        "link": "https://nightlightvisuals.itch.io/thistimearound",
        "images":{
            "image1": "/images/briefNlv.png",
            "image2": "/images/briefNlv.png"
        },
        "projectKey": {
            "available on":"Windows - MacOS",
            "created using": "Unity"
        },
        "projectDetails": {
            "Summary":"Alden Nowlan's quote 'The day the child realizes that all adults are imperfect, he becomes an adolescent; the day he forgives them, he becomes an adult; the day he forgives himself, he becomes wise.' makes up the backbone of the narrative for This Time Around. The inspiration for the story of This Time Around is actually a personal one. As someone who has trouble remembering their childhood, the idea of discovering it all again (essentially, for the first time) was fascinating to me and I wanted to pursue the idea that by revisiting your past you can learn and see things in a new perspective that you may have never considered before. As a player, you adopt the characters you play. Often times, players don't know the characters' history or background and you discover these things on your own and in your own time. Much like if I were to delve into my own childhood, most of which I don't remember, and that's how This Time Around came to be.",
            "Gameplay":"Players (re)discover memories as Rachel Daniels in This Time Around, learning things she may have forgotten or have never examined before through letters and objects throughout the game world. So often we forget to look at things from someone else's perspective, and we forget that everyone that comes and goes in our lives leaves behind a part of them within us. Good or bad, we learn from them, and This Time Around aims to be that reminder.",
            "Responsibilities":"This Time Around was a yearlong solo project. This included being the game designer, writer and programmer. The UI was also designed by myself. The models and audio used in the game however were sourced from Archive3d and Freesound.",
            "Experience": "The project was invaluable in terms of the things it taught me. Not only did I learn endless ways of problem solving in game development and how to code practically; with endless hours of researching and experimenting, I also learned how to develop a game design idea into a completed game through playtesting and a number of iterations. The project was iterated using a design-build-test cycle and that was the biggest learning experience of all. The cycle allowed me to understand user needs and the importance of playtesting and refining accordingly. In order to create a game for the target audience, this playtest and refinement cycle is vital. There is no doubt that the things I learned from this project can and will be carried forward to future projects."
        }
    },
    {
        "id": "201410",
        "background": {"backgroundImage":"url(images/briefTurntable.png)"},
        "title": "Arcade ft. Turntable",
        "role": "Game Designer & Developer",
        "type": "Digital",
        "intro": "Arcade is a small Unity scene developed to demonstrate a number of skills; such as Mecanim animation, AI behaviour, GUI implementation, saving and loading that also features a physics mini-game called Turntable.",
        "link": "https://github.com/CarNg/game-arcade",
        "images":{
            "image1": "/images/briefNlv.png",
            "image2": "/images/briefNlv.png"
        },
        "projectKey": {
            "available on":"Unity Webplayer (WebGL version and playable link coming soon)",
            "created using": "Unity"
        },
        "projectDetails": {
            "Summary":" Arcade was developed from a programming POV rather than game design. The goal was to include a number of different features to demonstrate different skills learned rather than focus on creating something fun.",
            "Gameplay":"Arcade contains two parts: an opening scene where players control a character around an aracde and a physics mini-game name Turntable. The opening scene demonstrates Mecanim animation and AI logic in the employee while the minigame features saving and loading and GUI implementation.",
            "Responsibilities":"Arcade was a solo exercise. I take credit for the programming and game design of the game. However, all models, audio and art work is not mine.",
            "Experience": "Arcade was a great exercise to become familiar with many of the basics of Unity and coding in C#. Although it is only a simple project, it helped significantly in building a solid base for me to expand and develop upon for future projects."
        }
    },
    {
        "id": "201409",
        "background": {"backgroundImage":"url(images/briefCircuits.png)"},
        "title": "Circuits",
        "role": "Game Designer",
        "type": "Analog",
        "intro": "Circuits is a unique 3D abstract puzzle game that challenges players' spatial awareness. Players build circuits from all angles, race to be the first to reach their secret goal, and block any threats they see coming!",
        "images":{
            "image1": "/images/briefNlv.png",
            "image2": "/images/briefNlv.png"
        },
        "projectKey": {
            "for":"2-4 players",
            "to play in": "~20minutes"
        },
        "projectDetails": {
            "Summary":"The goal of Circuits was to create an original non-digital game from start to finish. This included game design, creating and making the game components, packaging and designing the rule book. We wanted to create a game that differed from other tabletop games in terms of components so we decided on a 3D design and Circuits grew from there.",
            "Gameplay":"Circuits is a two to four player game where players create Circuits across the grid in order to complete their (secret) goal. Players can build from any angle by dropping in their coloured blocks and matching up their Circuit on any side. They'll also have the opportunity to block and interfere with other players' Circuits at any stage by using their one single use Blocker. The aim of the game is to establish an unbroken connection that starts from the base of the board and runs 6 blocks high to the designated end point. A dropped block must connect to your existing Circuit, if you run out of options or get successfully blocked, you're out of the game.",
            "Responsibilities":"Circuits was a group project where I worked with Aisling Flynn, Gemma Gallagher and Sona Harrison. No single role was assigned to anyone on the project as everything from design and production to completion was done collectively as a team.",
            "Experience": "Overall, I think that we developed the beginnings of an interesting and challenging game. There is no doubt that Circuits would need much more playtesting and refining in order to reach its full potential but I believe that it could have been developed into a strong game with time. The project was also a great demonstration of the power of working on a strong team that communicated and worked well together. Weekly meetings allowed us to present our individual ideas and research and discuss our next steps together, this allowed for a great, encouraging and supportive environment and allowed for a smooth process in producing Circuits."
        }
    },
    {
        "id": "201408",
        "background": {"backgroundImage":"url(images/briefHopscotch.png)"},
        "title": "Hopscotch 2: Elements",
        "role": "Game Designer",
        "type": "Analog",
        "intro": "Hopscotch 2: Elements was an 'unnecessary sequel' designed as part of a ludology class. The task was to find a game that was over 50 years old, determine its weak points and find solutions to create a stronger game.",
        "images":{
            "image1": "/images/briefNlv.png",
            "image2": "/images/briefNlv.png"
        },
        "projectKey": {
            "for":"2-4 players",
            "to play in": "~15minutes"
        },
        "projectDetails": {
            "Summary":"The first step in designing Hopscotch 2 was to examine hopscotch and determine what the weaknesses were. We found that the main flaw of the game is its repetition and lack of player interaction. So our goal was to add variety and randomness to the game and to add player interaction. We achieved this by adding ways to affect other players and making the 'track' random.",
            "Gameplay":"The 'track' of Hopscotch 2 is made up of separate piece (this can be pieces of foam or paper). Each piece will have its own colour and be associated with a single element. The track is constructed in a randomised pattern and each player is assigned an element. The starting element on the track will determine which players' turn it is. This player must hop to the end of the track using only the pieces associated with their element. When they are on their second piece, they must pick up the starting piece on the track (they can stand on two feet but must not fall off) and carry it with them till the end of the track. Once they are there, they must place it down at the end. Therefore, creating a new pattern. Each player also gets a single use 'stone' that can be used to help them on more difficult patterns. Players may toss the stone on the track which will allow them to then hop on the piece that the stone lands on regardless of element type. If a player falls or steps on the wrong element, they are eliminated along with all their element pieces on the track. The aim is to be the last one standing.",
            "Responsibilities":"Hopscotch 2 was a group project between me, Aisling Flynn, Philippa Kelly and Diana Volovei. The game was researched, designed and playtested collectively. However, the artwork in the images above was provided by Diana.",
            "Experience": "We found that the new elements (pun intended) added to the game made it more fun and significantly more engaging. It created more interaction between players as other players' turn would affect the 'track' which also added strategy into the game. The changing of the tracks also made the game more challenging as player elimination would increase the difficulty. Player elimination was originally a concern of ours but it didn't become a problem since games were often short (and its fun watching people struggling not to fall too). The project was an interesting and informative exercise in game design. Being able to examine a game, find the weaknesses and come up with solutions is a vital skill and this project was a great example of that."
        }
    },
    {
        "id": "201407",
        "background": {"backgroundImage":"url(images/briefPigeon.png)"},
        "title": "Pigeon Invasion",
        "role": "Game Developer and Producer",
        "type": "Digital",
        "intro": "Pigeon Invasion was a casual mobile game that was released on the App Store back in 2014. The game design was based on the classic 80's action game 'Choplifter'.",
        "link": "https://appadvice.com/app/pigeon-invasion/817549884",
        "images":{
            "image1": "/images/briefNlv.png",
            "image2": "/images/briefNlv.png"
        },
        "projectKey": {
            "available on":"iOS (now offline)",
            "created using": "-GameSalad",
            "for": "DIT"
        },
        "projectDetails": {
            "Summary":"Pigeon Invasion was a three month project that was aimed to gain experience in the full process of creating an app from scratch to releasing the game on the App Store and promoting the game afterwards.",
            "Gameplay":"Since three months was a short amount of time to create and publish an app from scratch, we chose to base the game's basic mechanics and design on an existing game. This allowed us to hit the ground running and Pigeon Invasion is based on the classic 'Choplifter'. Players play as a pigeon, flying through parks, streets and abandoned factories in order to collect food for their babies. All the while, they must avoid a number of obstacles such as angry dogs, menacing teenagers and toxic waste. It borrows the mechanics of Choplifter but applies it to a fun and humorous setting.",
            "Responsibilities":"Pigeon Invasion was a three person project that consisted of me, Michiel Rheiter and Gabriel Pavan. Michiel was the art designer and Gabriel worked on the project as the audio and level designer. Finally, I worked on the app as the programmer and producer. The game was developed in GameSalad and my role involved implementing the controls and mechanics of the game as well as applying the art and audio work received from other team members into the game. My role also included setting the tasks each week in order to keep the project on schedule. As we were working on a tight schedule it was vital that we met our marks each week.",
            "Experience": "Pigeon Invasion was my first group development project and it was a major learning experience in that sense. It showed the importance of establishing roles, communication and team work. It was clear that those aspects were able to make or break a project and a team. Understanding the importance of communication and team work allowed for much smoother group projects in the future. Pigeon Invasion was also my first experience with game testing and refining. The mechanics of the game, although based on Choplifter, took many iterations due to the translation from console controls to touchscreen controls. What the team initially taught would be relatively simple turned into a much larger and tedious task and many iterations were made during development as a result. It was also a great example on the importance of controls design and testing as it can change a game entirely."
        }
    }    
]
